Autodesk.Revit.DB.AnalyticalModelInContextUtils.GetLevelAssociationData(Autodesk.Revit.DB.Element)
Returns Level Association Data for the given analytical node.
Remarks:
If the element is not an Analytical Node, then it retruns null.
pNode:
Element for which we want level assoctiation data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.AnalyticalModelInContextUtils
This class has some utilitary functions for analytical model.
Since:
2023